Revit 2027 API
ViewCropRegionShapeManager.CanHaveAnnotationCrop Property
 Verifies that the view is allowed to have an annotation crop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveAnnotationCrop { get; }
Public ReadOnly Property CanHaveAnnotationCrop As Boolean
	Get
public:
property bool CanHaveAnnotationCrop {
	bool get ();
}
member CanHaveAnnotationCrop : bool with get
Property Value
Boolean
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace